Clash Bot Workflow - Apply
#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Workflow Apply 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Run</summary>

#### Workflow Apply
```

terraform
module.create_team_step_function.data.aws_region.current[0]: Reading...
data.aws_acm_certificate.issued: Reading...
data.aws_iam_policy_document.event_handler_policy_document: Reading...
module.create_team_step_function.data.aws_caller_identity.current: Reading...
module.create_team_step_function.data.aws_region.current[0]: Read complete after 0s [id=us-east-1]
data.aws_iam_policy_document.event_handler_policy_document: Read complete after 0s [id=927500948]
data.aws_iam_policy_document.event_publisher_policy_document: Reading...
data.aws_iam_policy_document.event_publisher_policy_document: Read complete after 0s [id=927500948]
module.create_team_step_function.data.aws_iam_policy_document.assume_role[0]: Reading...
module.create_team_step_function.data.aws_caller_identity.current: Read complete after 0s [id=816923827429]
module.create_team_step_function.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=4239894905]
data.aws_acm_certificate.issued: Read complete after 0s [id=arn:aws:acm:us-east-1:816923827429:certificate/1d277044-1781-46f9-b693-50c8ff95546a]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # aws_cloudwatch_log_group.api_gateway_default_log_group will be created
  + resource "aws_cloudwatch_log_group" "api_gateway_default_log_group" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "api_gateway_default_log_group-development"
      + name_prefix       = (known after apply)
      + retention_in_days = 0
      + skip_destroy      = false
      + tags_all          = {
          + "Application" = "ClashBot-Workflow"
          + "Environment" = "development"
        }
    }

  # aws_iam_policy.event_handler_policy will be created
  + resource "aws_iam_policy" "event_handler_policy" {
      + arn         = (known after apply)
      + description = "Allows the event handler lambda to interact with SQS and CloudWatch Logs"
      + id          = (known after apply)
      + name        = "ClashBotWorkflowEventHandlerPolicy-development"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:PutLogEvents",
                          + "logs:CreateLogStream",
                          + "logs:CreateLogGroup",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "sqs:ReceiveMessage",
                          + "sqs:GetQueueAttributes",
                          + "sqs:DeleteMessage",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = {
          + "Application" = "ClashBot-Workflow"
          + "Environment" = "development"
        }
    }

  # aws_iam_policy.event_publisher_policy will be created
  + resource "aws_iam_policy" "event_publisher_policy" {
      + arn         = (known after apply)
      + description = "Allows the event publisher lambda to publish events to the event queue and log events to CloudWatch"
      + id          = (known after apply)
      + name        = "ClashBotEventPublisherPolicy-development"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:PutLogEvents",
                          + "logs:CreateLogStream",
                          + "logs:CreateLogGroup",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "sqs:ReceiveMessage",
                          + "sqs:GetQueueAttributes",
                          + "sqs:DeleteMessage",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = {
          + "Application" = "ClashBot-Workflow"
          + "Environment" = "development"
        }
    }

  # aws_iam_role.lambda_handler_exec will be created
  + resource "aws_iam_role" "lambda_handler_exec" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "clash_bot_event_handler_exec_role-development"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "Application" = "ClashBot-Workflow"
          + "Environment" = "development"
        }
      + unique_id             = (known after apply)
    }

  # aws_iam_role.lambda_publisher_exec will be created
  + resource "aws_iam_role" "lambda_publisher_exec" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "clash_bot_event_publisher_exec_role-development"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "Application" = "ClashBot-Workflow"
          + "Environment" = "development"
        }
      + unique_id             = (known after apply)
    }

  # aws_iam_role_policy_attachment.lambda_handler_exec_policy will be created
  + resource "aws_iam_role_policy_attachment" "lambda_handler_exec_policy" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "clash_bot_event_handler_exec_role-development"
    }

  # aws_iam_role_policy_attachment.lambda_publisher_exec_policy will be created
  + resource "aws_iam_role_policy_attachment" "lambda_publisher_exec_policy" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "clash_bot_event_publisher_exec_role-development"
    }

  # aws_lambda_event_source_mapping.sqs_trigger will be created
  + resource "aws_lambda_event_source_mapping" "sqs_trigger" {
      + batch_size                    = 1
      + enabled                       = true
      + event_source_arn              = (known after apply)
      + function_arn                  = (known after apply)
      + function_name                 = "clash-bot-event-handler-development"
      + id                            = (known after apply)
      + last_modified                 = (known after apply)
      + last_processing_result        = (known after apply)
      + maximum_record_age_in_seconds = (known after apply)
      + maximum_retry_attempts        = (known after apply)
      + parallelization_factor        = (known after apply)
      + state                         = (known after apply)
      + state_transition_reason       = (known after apply)
      + uuid                          = (known after apply)
    }

  # aws_lambda_function.event_handler_lambda will be created
  + resource "aws_lambda_function" "event_handler_lambda" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + function_name                  = "clash-bot-event-handler-development"
      + handler                        = "prod/handler.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "nodejs16.x"
      + s3_bucket                      = "clash-bot-lambda-bucket"
      + s3_key                         = "artifacts/development/116/event-handler.zip"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = {
          + "Application" = "ClashBot-Workflow"
          + "Environment" = "development"
        }
      + timeout                        = 3
      + version                        = (known after apply)

      + environment {
          + variables = (known after apply)
        }
    }

  # aws_lambda_function.event_publisher_lambda will be created
  + resource "aws_lambda_function" "event_publisher_lambda" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + function_name                  = "clash-bot-event-publisher-development"
      + handler                        = "prod/handler.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "nodejs16.x"
      + s3_bucket                      = "clash-bot-lambda-bucket"
      + s3_key                         = "artifacts/development/116/event-publisher.zip"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = {
          + "Application" = "ClashBot-Workflow"
          + "Environment" = "development"
        }
      + timeout                        = 3
      + version                        = (known after apply)

      + environment {
          + variables = (known after apply)
        }
    }

  # aws_lambda_permission.apigw will be created
  + resource "aws_lambda_permission" "apigw" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "clash-bot-event-publisher-development"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "AllowExecutionFromAPIGateway-development"
      + statement_id_prefix = (known after apply)
    }

  # module.api_gateway.aws_apigatewayv2_api.this[0] will be created
  + resource "aws_apigatewayv2_api" "this" {
      + api_endpoint                 = (known after apply)
      + api_key_selection_expression = "$request.header.x-api-key"
      + arn                          = (known after apply)
      + description                  = "Clash Bot Workflow API Gateway for the development environment"
      + disable_execute_api_endpoint = false
      + execution_arn                = (known after apply)
      + id                           = (known after apply)
      + name                         = "clash-bot-workflow-development"
      + protocol_type                = "HTTP"
      + route_selection_expression   = "$request.method $request.path"
      + tags_all                     = {
          + "Application" = "ClashBot-Workflow"
          + "Environment" = "development"
        }

      + cors_configuration {
          + allow_headers = [
              + "authorization",
              + "content-type",
              + "x-amz-date",
              + "x-amz-security-token",
              + "x-amz-user-agent",
              + "x-api-key",
            ]
          + allow_methods = [
              + "*",
            ]
          + allow_origins = [
              + "*",
            ]
        }
    }

  # module.api_gateway.aws_apigatewayv2_api_mapping.this[0] will be created
  + resource "aws_apigatewayv2_api_mapping" "this" {
      + api_id      = (known after apply)
      + domain_name = (known after apply)
      + id          = (known after apply)
      + stage       = (known after apply)
    }

  # module.api_gateway.aws_apigatewayv2_domain_name.this[0] will be created
  + resource "aws_apigatewayv2_domain_name" "this" {
      + api_mapping_selection_expression = (known after apply)
      + arn                              = (known after apply)
      + domain_name                      = "clash-bot.ninja"
      + id                               = (known after apply)
      + tags_all                         = {
          + "Application" = "ClashBot-Workflow"
          + "Environment" = "development"
        }

      + domain_name_configuration {
          + certificate_arn                        = "arn:aws:acm:us-east-1:816923827429:certificate/1d277044-1781-46f9-b693-50c8ff95546a"
          + endpoint_type                          = "REGIONAL"
          + hosted_zone_id                         = (known after apply)
          + ownership_verification_certificate_arn = (known after apply)
          + security_policy                        = "TLS_1_2"
          + target_domain_name                     = (known after apply)
        }
    }

  # module.api_gateway.aws_apigatewayv2_integration.this["POST /api/v2"] will be created
  + resource "aws_apigatewayv2_integration" "this" {
      + api_id                                    = (known after apply)
      + connection_type                           = "INTERNET"
      + id                                        = (known after apply)
      + integration_method                        = "POST"
      + integration_response_selection_expression = (known after apply)
      + integration_type                          = "AWS_PROXY"
      + integration_uri                           = (known after apply)
      + payload_format_version                    = "1.0"
      + timeout_milliseconds                      = (known after apply)
    }

  # module.api_gateway.aws_apigatewayv2_route.this["POST /api/v2"] will be created
  + resource "aws_apigatewayv2_route" "this" {
      + api_id             = (known after apply)
      + api_key_required   = false
      + authorization_type = "NONE"
      + id                 = (known after apply)
      + route_key          = "POST /api/v2"
      + target             = (known after apply)
    }

  # module.api_gateway.aws_apigatewayv2_stage.default[0] will be created
  + resource "aws_apigatewayv2_stage" "default" {
      + api_id        = (known after apply)
      + arn           = (known after apply)
      + auto_deploy   = true
      + deployment_id = (known after apply)
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + name          = "$default"
      + tags_all      = {
          + "Application" = "ClashBot-Workflow"
          + "Environment" = "development"
        }
    }

  # module.clash_bot_event_sqs.aws_sqs_queue.this[0] will be created
  + resource "aws_sqs_queue" "this" {
      + arn                               = (known after apply)
      + content_based_deduplication       = false
      + deduplication_scope               = (known after apply)
      + delay_seconds                     = 0
      + fifo_queue                        = true
      + fifo_throughput_limit             = (known after apply)
      + id                                = (known after apply)
      + kms_data_key_reuse_period_seconds = (known after apply)
      + max_message_size                  = 262144
      + message_retention_seconds         = 345600
      + name                              = "clash-bot-event-sqs-development.fifo"
      + name_prefix                       = (known after apply)
      + policy                            = (known after apply)
      + receive_wait_time_seconds         = 0
      + redrive_allow_policy              = (known after apply)
      + redrive_policy                    = (known after apply)
      + sqs_managed_sse_enabled           = true
      + tags_all                          = {
          + "Application" = "ClashBot-Workflow"
          + "Environment" = "development"
        }
      + url                               = (known after apply)
      + visibility_timeout_seconds        = 30
    }

  # module.create_team_step_function.data.aws_iam_policy_document.service["dynamodb"] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "service" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "dynamodb:DeleteItem",
              + "dynamodb:GetItem",
              + "dynamodb:PutItem",
              + "dynamodb:UpdateItem",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
          + sid       = "dynamodbDynamodb"
        }
    }

  # module.create_team_step_function.aws_iam_policy.service["dynamodb"] will be created
  + resource "aws_iam_policy" "service" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = "retrieve-teams-development-dynamodb"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = (known after apply)
      + policy_id   = (known after apply)
      + tags_all    = {
          + "Application" = "ClashBot-Workflow"
          + "Environment" = "development"
        }
    }

  # module.create_team_step_function.aws_iam_policy_attachment.service["dynamodb"] will be created
  + resource "aws_iam_policy_attachment" "service" {
      + id         = (known after apply)
      + name       = "retrieve-teams-development-dynamodb"
      + policy_arn = (known after apply)
      + roles      = [
          + "retrieve-teams-development",
        ]
    }

  # module.create_team_step_function.aws_iam_role.this[0] will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "states.us-east-1.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "retrieve-teams-development"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "Application" = "ClashBot-Workflow"
          + "Environment" = "development"
        }
      + unique_id             = (known after apply)
    }

  # module.create_team_step_function.aws_sfn_state_machine.this[0] will be created
  + resource "aws_sfn_state_machine" "this" {
      + arn                       = (known after apply)
      + creation_date             = (known after apply)
      + definition                = <<-EOT
            {
                "Comment": "A Hello World example of the Amazon States Language using Pass states",
                "StartAt": "Hello",
                "States": {
                  "Hello": {
                    "Type": "Pass",
                    "Result": "Hello",
                    "Next": "World"
                  },
                  "World": {
                    "Type": "Pass",
                    "Result": "World",
                    "End": true
                  }
                }
              }
        EOT
      + description               = (known after apply)
      + id                        = (known after apply)
      + name                      = "retrieve-teams-development"
      + name_prefix               = (known after apply)
      + publish                   = false
      + revision_id               = (known after apply)
      + role_arn                  = (known after apply)
      + state_machine_version_arn = (known after apply)
      + status                    = (known after apply)
      + tags                      = {
          + "Name" = "retrieve-teams-development"
        }
      + tags_all                  = {
          + "Application" = "ClashBot-Workflow"
          + "Environment" = "development"
          + "Name"        = "retrieve-teams-development"
        }
      + type                      = "STANDARD"
      + version_description       = (known after apply)

      + timeouts {}
    }

  # module.dynamodb_table.aws_dynamodb_table.this[0] will be created
  + resource "aws_dynamodb_table" "this" {
      + arn              = (known after apply)
      + billing_mode     = "PROVISIONED"
      + hash_key         = "type"
      + id               = (known after apply)
      + name             = "clash-bot-workflow-development"
      + range_key        = "id"
      + read_capacity    = 1
      + stream_arn       = (known after apply)
      + stream_enabled   = false
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags             = {
          + "Name" = "clash-bot-workflow-development"
        }
      + tags_all         = {
          + "Application" = "ClashBot-Workflow"
          + "Environment" = "development"
          + "Name"        = "clash-bot-workflow-development"
        }
      + write_capacity   = 5

      + attribute {
          + name = "id"
          + type = "S"
        }
      + attribute {
          + name = "type"
          + type = "S"
        }

      + point_in_time_recovery {
          + enabled = false
        }

      + server_side_encryption {
          + enabled     = false
          + kms_key_arn = (known after apply)
        }

      + timeouts {
          + create = "10m"
          + delete = "10m"
          + update = "60m"
        }

      + ttl {
          + enabled = false
        }
    }

Plan: 23 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + api-gateway-endpoint           = (known after apply)
  + event-handler-lambda-arn       = (known after apply)
  + event-handler-lambda-version   = (known after apply)
  + event-publisher-lambda-arn     = (known after apply)
  + event-publisher-lambda-version = (known after apply)
  + event-sqs                      = (known after apply)
  + step-function-arn              = (known after apply)
aws_iam_role.lambda_handler_exec: Creating...
aws_iam_policy.event_handler_policy: Creating...
aws_iam_policy.event_publisher_policy: Creating...
aws_cloudwatch_log_group.api_gateway_default_log_group: Creating...
aws_iam_role.lambda_publisher_exec: Creating...
module.clash_bot_event_sqs.aws_sqs_queue.this[0]: Creating...
module.api_gateway.aws_apigatewayv2_api.this[0]: Creating...
module.dynamodb_table.aws_dynamodb_table.this[0]: Creating...
module.api_gateway.aws_apigatewayv2_domain_name.this[0]: Creating...
module.create_team_step_function.aws_iam_role.this[0]: Creating...
aws_cloudwatch_log_group.api_gateway_default_log_group: Creation complete after 0s [id=api_gateway_default_log_group-development]
aws_iam_policy.event_publisher_policy: Creation complete after 0s [id=arn:aws:iam::816923827429:policy/ClashBotEventPublisherPolicy-development]
aws_iam_policy.event_handler_policy: Creation complete after 0s [id=arn:aws:iam::816923827429:policy/ClashBotWorkflowEventHandlerPolicy-development]
aws_iam_role.lambda_publisher_exec: Creation complete after 0s [id=clash_bot_event_publisher_exec_role-development]
aws_iam_role_policy_attachment.lambda_publisher_exec_policy: Creating...
aws_iam_role.lambda_handler_exec: Creation complete after 0s [id=clash_bot_event_handler_exec_role-development]
aws_iam_role_policy_attachment.lambda_handler_exec_policy: Creating...
module.create_team_step_function.aws_iam_role.this[0]: Creation complete after 0s [id=retrieve-teams-development]
aws_iam_role_policy_attachment.lambda_publisher_exec_policy: Creation complete after 0s [id=clash_bot_event_publisher_exec_role-development-20231114021900384100000001]
aws_iam_role_policy_attachment.lambda_handler_exec_policy: Creation complete after 0s [id=clash_bot_event_handler_exec_role-development-20231114021900396600000002]
module.api_gateway.aws_apigatewayv2_api.this[0]: Creation complete after 1s [id=qnjc7eob9l]
module.api_gateway.aws_apigatewayv2_domain_name.this[0]: Creation complete after 4s [id=clash-bot.ninja]
module.dynamodb_table.aws_dynamodb_table.this[0]: Creation complete after 7s [id=clash-bot-workflow-development]
module.create_team_step_function.data.aws_iam_policy_document.service["dynamodb"]: Reading...
module.create_team_step_function.data.aws_iam_policy_document.service["dynamodb"]: Read complete after 0s [id=3233016293]
module.create_team_step_function.aws_sfn_state_machine.this[0]: Creating...
module.create_team_step_function.aws_iam_policy.service["dynamodb"]: Creating...
module.create_team_step_function.aws_iam_policy.service["dynamodb"]: Creation complete after 0s [id=arn:aws:iam::816923827429:policy/retrieve-teams-development-dynamodb]
module.create_team_step_function.aws_iam_policy_attachment.service["dynamodb"]: Creating...
module.create_team_step_function.aws_sfn_state_machine.this[0]: Creation complete after 0s [id=arn:aws:states:us-east-1:816923827429:stateMachine:retrieve-teams-development]
aws_lambda_function.event_handler_lambda: Creating...
module.create_team_step_function.aws_iam_policy_attachment.service["dynamodb"]: Creation complete after 1s [id=retrieve-teams-development-dynamodb]
module.clash_bot_event_sqs.aws_sqs_queue.this[0]: Still creating... [10s elapsed]
aws_lambda_function.event_handler_lambda: Creation complete after 7s [id=clash-bot-event-handler-development]
module.clash_bot_event_sqs.aws_sqs_queue.this[0]: Still creating... [20s elapsed]
module.clash_bot_event_sqs.aws_sqs_queue.this[0]: Creation complete after 25s [id=https://sqs.us-east-1.amazonaws.com/816923827429/clash-bot-event-sqs-development.fifo]
aws_lambda_event_source_mapping.sqs_trigger: Creating...
aws_lambda_function.event_publisher_lambda: Creating...
aws_lambda_function.event_publisher_lambda: Creation complete after 7s [id=clash-bot-event-publisher-development]
aws_lambda_permission.apigw: Creating...
module.api_gateway.aws_apigatewayv2_integration.this["POST /api/v2"]: Creating...
module.api_gateway.aws_apigatewayv2_stage.default[0]: Creating...
aws_lambda_permission.apigw: Creation complete after 0s [id=AllowExecutionFromAPIGateway-development]
module.api_gateway.aws_apigatewayv2_integration.this["POST /api/v2"]: Creation complete after 0s [id=977hi74]
module.api_gateway.aws_apigatewayv2_route.this["POST /api/v2"]: Creating...
module.api_gateway.aws_apigatewayv2_route.this["POST /api/v2"]: Creation complete after 0s [id=z09zhs7]
module.api_gateway.aws_apigatewayv2_stage.default[0]: Creation complete after 1s [id=$default]
module.api_gateway.aws_apigatewayv2_api_mapping.this[0]: Creating...
module.api_gateway.aws_apigatewayv2_api_mapping.this[0]: Creation complete after 0s [id=nbvx3r]
aws_lambda_event_source_mapping.sqs_trigger: Still creating... [10s elapsed]
aws_lambda_event_source_mapping.sqs_trigger: Still creating... [20s elapsed]
aws_lambda_event_source_mapping.sqs_trigger: Creation complete after 24s [id=ed4502fa-0629-45db-8d0f-64772ecf801e]

Apply complete! Resources: 23 added, 0 changed, 0 destroyed.

Outputs:

api-gateway-endpoint = "https://qnjc7eob9l.execute-api.us-east-1.amazonaws.com"
event-handler-lambda-arn = "arn:aws:lambda:us-east-1:816923827429:function:clash-bot-event-handler-development"
event-handler-lambda-version = "$LATEST"
event-publisher-lambda-arn = "arn:aws:lambda:us-east-1:816923827429:function:clash-bot-event-publisher-development"
event-publisher-lambda-version = "$LATEST"
event-sqs = "arn:aws:sqs:us-east-1:816923827429:clash-bot-event-sqs-development.fifo"
step-function-arn = "arn:aws:states:us-east-1:816923827429:stateMachine:retrieve-teams-development"

```

</details>

*Pushed by: @Poss111, Action: `pull_request`*